2018/tree-dfs.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-03-11 周一 21:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>树的深度优先遍历</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">树的深度优先遍历</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7de1441">1. 前言</a></li>
<li><a href="#org0f907f5">2. 树类型</a></li>
<li><a href="#org5c4c4a4">3. 使用递归的深度优先遍历</a></li>
<li><a href="#org3ff8af3">4. 使用栈的深度优先遍历</a></li>
<li><a href="#orgef3f026">5. 使用栈的深度优先遍历 · 补</a></li>
<li><a href="#org9ee6091">6. 结语</a></li>
<li><a href="#org8b83a63">7. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7de1441" class="outline-2">
<h2 id="org7de1441"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
前段时间了解到可以用 <b>队列</b> 实现 <a href="tree-bfs.html">树的广度优先遍历</a> 后，在 <a href="https://leetcode-cn.com/">LeetCode</a> 刷题的时候，
又发现可以用 <b>栈</b> 来实现 <b>树的深度优先遍历</b>.
</p>

<p>
这是一个值得思考的发现！
</p>
</div>
</div>

<div id="outline-container-org0f907f5" class="outline-2">
<h2 id="org0f907f5"><span class="section-number-2">2</span> 树类型</h2>
<div class="outline-text-2" id="text-2">
<p>
考虑到之后的内容会用到这两个树类型，就先在这里把它们列出来好了：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">&#20108;&#21449;&#26641;</span>
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">BinaryTree</span> {
  <span class="org-keyword">public</span> <span class="org-type">int</span> <span class="org-variable-name">val</span>;
  <span class="org-keyword">public</span> <span class="org-type">BinaryTree</span> <span class="org-variable-name">left</span>;
  <span class="org-keyword">public</span> <span class="org-type">BinaryTree</span> <span class="org-variable-name">right</span>;

  <span class="org-keyword">public</span> <span class="org-function-name">BinaryTree</span>(<span class="org-type">int</span> <span class="org-variable-name">val</span>) {
    <span class="org-keyword">this</span>.val = val;
  }
}

<span class="org-comment-delimiter">// </span><span class="org-comment">&#22810;&#21449;&#26641;</span>
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">GenericTree</span> {
  <span class="org-keyword">public</span> <span class="org-type">int</span> <span class="org-variable-name">val</span>;
  <span class="org-keyword">public</span> <span class="org-type">List</span>&lt;<span class="org-type">GenericTree</span>&gt; <span class="org-variable-name">children</span>;

  <span class="org-keyword">public</span> <span class="org-function-name">GenericTree</span>(<span class="org-type">int</span> <span class="org-variable-name">val</span>) {
    <span class="org-keyword">this</span>.val = val;
    <span class="org-keyword">this</span>.children = <span class="org-keyword">new</span> <span class="org-type">ArrayList</span>&lt;<span class="org-type">GenericTree</span>&gt;();
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c4c4a4" class="outline-2">
<h2 id="org5c4c4a4"><span class="section-number-2">3</span> 使用递归的深度优先遍历</h2>
<div class="outline-text-2" id="text-3">
<p>
使用递归实现树的深度优先遍历实在是太简单了，随便一本教材都会讲到这一实现，就不多说了，
直接上代码：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">RecursiveTraversal</span> {
  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">traversal</span>(<span class="org-type">BinaryTree</span> <span class="org-variable-name">root</span>) {
    <span class="org-keyword">if</span> (root == <span class="org-constant">null</span>) {
      <span class="org-keyword">return</span>;
    }

    traversal(root.left);
    traversal(root.right);

    visit(root);
  }

  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">traversal</span>(<span class="org-type">GenericTree</span> <span class="org-variable-name">root</span>) {
    <span class="org-keyword">if</span> (root == <span class="org-constant">null</span>) {
      <span class="org-keyword">return</span>;
    }

    <span class="org-keyword">for</span> (<span class="org-type">GenericTree</span> <span class="org-variable-name">child</span> : root.children) {
      traversal(child);
    }

    visit(root);
  }

  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">visit</span>(<span class="org-type">BinaryTree</span> <span class="org-variable-name">node</span>) {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#35775;&#38382;&#22788;&#29702;&#33410;&#28857;</span>
  }

  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">visit</span>(<span class="org-type">GenericTree</span> <span class="org-variable-name">node</span>) {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#35775;&#38382;&#22788;&#29702;&#33410;&#28857;</span>
  }
}
</pre>
</div>

<p>
<b>NOTE:</b> 这里的实现只考虑先访问叶子节点，在访问父节点的遍历类型，对于二叉树来说，对应的就是 <b>后序遍历</b>.
</p>
</div>
</div>

<div id="outline-container-org3ff8af3" class="outline-2">
<h2 id="org3ff8af3"><span class="section-number-2">4</span> 使用栈的深度优先遍历</h2>
<div class="outline-text-2" id="text-4">
<p>
使用栈实现树的深度优先遍历的基本思路是利用栈 <b>后进先出</b> 的特性，将父节点保存到栈中，
出栈时的节点优先为子节点。
</p>

<p>
当然，还有一个隐含的条件为：得到的节点是树的根结点。
</p>

<p>
首先是使用栈实现二叉树的深度优先遍历：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">StackTraversal</span> {
  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">traversal</span>(<span class="org-type">BinaryTree</span> <span class="org-variable-name">root</span>) {
    <span class="org-type">Deque</span>&lt;<span class="org-type">BinaryTree</span>&gt; <span class="org-variable-name">stack</span> = <span class="org-keyword">new</span> <span class="org-type">ArrayDeque</span>&lt;<span class="org-type">BinaryTree</span>&gt;();
    <span class="org-type">BinaryTree</span> <span class="org-variable-name">lastVisited</span> = <span class="org-constant">null</span>;  <span class="org-comment-delimiter">// </span><span class="org-comment">&#26368;&#21518;&#19968;&#20010;&#35775;&#38382; visit &#30340;&#33410;&#28857;</span>

    <span class="org-keyword">while</span> (<span class="org-negation-char">!</span>stack.isEmpty() || root != <span class="org-constant">null</span>) {
      <span class="org-keyword">if</span> (root != <span class="org-constant">null</span>) {
        stack.addFirst(root);
        root = root.left;
      } <span class="org-keyword">else</span> {
        <span class="org-type">BinaryTree</span> <span class="org-variable-name">peekNode</span> = stack.peekFirst();
        <span class="org-keyword">if</span> (peekNode.right != <span class="org-constant">null</span> &amp;&amp; lastVisited != peekNode.right) {  <span class="org-comment-delimiter">// </span><span class="org-comment">&#21028;&#26029;&#35813;&#33410;&#28857;&#30340;&#21491;&#23376;&#33410;&#28857;&#26159;&#21542;&#24050;&#35775;&#38382;</span>
          root = peekNode.right;
        } <span class="org-keyword">else</span> {
          visit(peekNode);
          lastVisited = stack.removeFirst();
        }
      }
    }
  }

  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">visit</span>(<span class="org-type">BinaryTree</span> <span class="org-variable-name">node</span>) {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#35775;&#38382;&#22788;&#29702;&#33410;&#28857;</span>
  }
}
</pre>
</div>

<p>
这里实现的依旧是二叉树的 <b>后序遍历</b>, 实现难度是三种遍历方式中最大的，所以直接看代码可能不太容易理解。
</p>

<p>
算法可视化的工具也没找到合适的，就先将就着看吧 @_@
</p>

<p>
然后是使用栈实现多叉树的深度优先遍历：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">StackTraversal</span> {
  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">traversal</span>(<span class="org-type">GenericTree</span> <span class="org-variable-name">root</span>) {
    <span class="org-keyword">if</span> (root == <span class="org-constant">null</span>) {
      <span class="org-keyword">return</span>;
    }

    <span class="org-type">Deque</span>&lt;<span class="org-type">BinaryTree</span>&gt; <span class="org-variable-name">stack</span> = <span class="org-keyword">new</span> <span class="org-type">ArrayDeque</span>&lt;<span class="org-type">BinaryTree</span>&gt;();
    <span class="org-type">BinaryTree</span> <span class="org-variable-name">lastVisited</span> = <span class="org-constant">null</span>;

    stack.addFirst(root);

    <span class="org-keyword">while</span> (<span class="org-negation-char">!</span>stack.isEmpty()) {
      <span class="org-type">BinaryTree</span> <span class="org-variable-name">peekNode</span> = stack.peekFirst();

      <span class="org-keyword">if</span> (peekNode.children.size() != 0 &amp;&amp; lastVisited != peekNode.children.get(0)) {  <span class="org-comment-delimiter">// </span><span class="org-comment">&#21028;&#26029;&#35813;&#33410;&#28857;&#30340;&#23376;&#33410;&#28857;&#26159;&#21542;&#24050;&#35775;&#38382;</span>
        <span class="org-keyword">for</span> (<span class="org-type">GenericTree</span> <span class="org-variable-name">child</span> : peekNode.children) {
          stack.addFirst(child);
        }
      } <span class="org-keyword">else</span> {
        visit(peekNode);
        lastVisited = stack.removeFirst();
      }
    }
  }

  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">visit</span>(<span class="org-type">GenericTree</span> <span class="org-variable-name">node</span>) {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#35775;&#38382;&#22788;&#29702;&#33410;&#28857;</span>
  }
}
</pre>
</div>

<p>
道理和二叉树的差不多，但感觉应该比二叉树的容易理解些。
</p>

<p>
<b>NOTE:</b> 栈是用双端队列近似模拟的，这也是 JDK 推荐的方式。
</p>
</div>
</div>

<div id="outline-container-orgef3f026" class="outline-2">
<h2 id="orgef3f026"><span class="section-number-2">5</span> 使用栈的深度优先遍历 · 补</h2>
<div class="outline-text-2" id="text-5">
<p>
想了一下，决定还是补一份使用栈实现二叉树的先序遍历和中序遍历的代码：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">preOrder</span>(<span class="org-type">BinaryTree</span> <span class="org-variable-name">root</span>) {
  <span class="org-keyword">if</span> (root == <span class="org-constant">null</span>) {
    <span class="org-keyword">return</span>;
  }

  <span class="org-type">Deque</span>&lt;<span class="org-type">BinaryTree</span>&gt; <span class="org-variable-name">stack</span> = <span class="org-keyword">new</span> <span class="org-type">ArrayDeque</span>&lt;<span class="org-type">BinaryTree</span>&gt;();

  stack.addFirst(root);

  <span class="org-keyword">while</span> (<span class="org-negation-char">!</span>stack.isEmpty()) {
    <span class="org-type">BinaryTree</span> <span class="org-variable-name">node</span> = stack.removeFirst();

    visit(node);

    <span class="org-keyword">if</span> (node.right != <span class="org-constant">null</span>) {  <span class="org-comment-delimiter">// </span><span class="org-comment">&#26632;&#26159;&#21518;&#36827;&#20808;&#20986;&#30340;</span>
      stack.addFirst(node.right);
    }

    <span class="org-keyword">if</span> (node.left != <span class="org-constant">null</span>) {
      stack.addFirst(node.left);
    }
  }
}

<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">inOrder</span>(<span class="org-type">BinaryTree</span> <span class="org-variable-name">root</span>) {
  <span class="org-type">Deque</span>&lt;<span class="org-type">BinaryTree</span>&gt; <span class="org-variable-name">stack</span> = <span class="org-keyword">new</span> <span class="org-type">ArrayDeque</span>&lt;<span class="org-type">BinaryTree</span>&gt;();

  <span class="org-keyword">while</span> (<span class="org-negation-char">!</span>stack.isEmpty() || root != <span class="org-constant">null</span>) {
    <span class="org-keyword">if</span> (root != <span class="org-constant">null</span>) {
      stack.addFirst(root);
      root = root.left;
    } <span class="org-keyword">else</span> {
      root = stack.removeFirst();
      visit(root);
      root = root.right;
    }
  }
}
</pre>
</div>

<p>
总感觉代码写的有点丑 @_@
</p>
</div>
</div>

<div id="outline-container-org9ee6091" class="outline-2">
<h2 id="org9ee6091"><span class="section-number-2">6</span> 结语</h2>
<div class="outline-text-2" id="text-6">
<p>
通过 <b>栈</b> 来实现 <b>树的深度优先遍历</b> 并不是很难，更重要的地方在于用 <b>栈</b> 来代替 <b>递归</b> 的想法。
</p>

<p>
最近学习 <b>编译原理</b> 的过程中，语法分析部分提到过：递归调用的方式会 <b>隐式</b> 地维护一个栈，某些情况下，
可以通过 <b>显式</b> 地维护一个栈来消除递归。
</p>

<p>
递归下降预测分析器到非递归预测下降分析器就是通过这样的方式实现的。
</p>

<p>
递归和栈孰优孰劣先不讨论，通过栈消除递归的做法还是很有启发性的，值得学习！
</p>
</div>
</div>

<div id="outline-container-org8b83a63" class="outline-2">
<h2 id="org8b83a63"><span class="section-number-2">7</span> 参考链接</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Tree_traversal">Tree traversal - wiki</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
